       IDENTIFICATION DIVISION.
       PROGRAM-ID. Instrumentos.

       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
       01 LS-CONECTAR PIC X.

       PROCEDURE DIVISION USING LS-CONECTAR.
       MAIN SECTION.
       PROGRAM-BEGIN.
       DISPLAY " ".
       DISPLAY "Instrumentos"

       STOP RUN.

       EXIT PROGRAM.
