       IDENTIFICATION DIVISION.
       PROGRAM-ID. Proveedores.

       ENVIRONMENT DIVISION.
       INPUT-OUTPUT SECTION.

       FILE-CONTROL.
       SELECT OPTIONAL PROVEEDORES-ARCHIVO
       ASSIGN TO "c:\proveedores.dat"
       ORGANIZATION IS INDEXED
       RECORD KEY IS ID-PROVEEDOR
       ACCESS MODE IS DYNAMIC.

       DATA DIVISION.
       FILE SECTION.

       WORKING-STORAGE SECTION.

       LINKAGE SECTION.
       01 LS-CONECTAR PIC X.

       PROCEDURE DIVISION USING LS-CONECTAR.
       MAIN SECTION.
       PROGRAM-BEGIN.
       DISPLAY " ".
       DISPLAY "Proveedores"

       STOP RUN.

       EXIT PROGRAM.
